[
  {
    "Time": "2020-01-12 12:16:19",
    "Name (First)": "Gianamar",
    "Name (Last)": "Giovannetti-Singh",
    "Email": "gg410@cam.ac.uk",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Credibility in Circulation: What Role Did Non-European Knowledges Have in Shaping the Methods of Modern Disciplines?",
    "Session idea, abstract, or other information relevant for potential collaborators": "In 2006, Kapil Raj published his ground-breaking Relocating Modern Science, in which he argued that historians of science have much to learn from relocating their studies of the construction of knowledge from \"local\" sites to spaces of circulation. This shift, Raj argues, reveals the indispensable role played by non-European actors and knowledges in the co-construction of methods and practices that have gone on to shape modern \"Western\" science. Since then, historians-particularly those striving to understand the non-Western character of what has elsewhere been characterised as \"European modernity\"-have employed Raj's methods to great effect. One key issue that deserves further examination, using episodes from across historical and geographical regions, is that of the credibility of non-European methods in shaping emergent disciplines in the Enlightenment. For example, in his recent work on the \"first global turn\", Alexander Statman has suggested that Europeans' encounters with Chinese history in the seventeenth and eighteenth centuries radically reshaped conceptions of what history could look like as an academic discipline. How does a shift from local to circulating spaces change the way historians of science can analyse the construction of credibility? This panel seeks to explore the processes involved in constructing credibility in spaces of circulation and examine whether this reveals previously under-appreciated non-European influences upon ostensibly \"European\" methods in emergent disciplines during the Enlightenment.",
    "Abstract Topic": "Tools for Historians of Science",
    "Abstract Chronology": "Cultural and cross-cultural contexts, including colonialism in general",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "Enlightenment; disciplinarity; cross-cultural encounters; modernity; circulation",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Safari 13.0.2 / OS X",
    "IP Address": "131.111.5.151",
    "Unique ID": 571502471,
    "Location": "52.200000762939, 0.11670000106096"
  },
  {
    "Time": "2020-01-17 02:01:32",
    "Name (First)": "Pratik",
    "Name (Last)": "Chakrabarti",
    "Email": "pratik.chakrabarti@manchester.ac.uk",
    "I'm interested in...": "Forming a roundtable",
    "Tentative Title": "Is Deep History White?",
    "Session idea, abstract, or other information relevant for potential collaborators": "The need for the roundtable discussion emerges from the realization that the history of deep time is predominantly derived from the works of European savants from the eighteenth century. These propositions refer to European intellectual traditions, antiquarianism and religious debates. Similarly, the histories of deep time and geohistory too are invested in European intellectual traditions, museums, institutions, print cultures and epistemologies even when these have extended these beyond Europe.<br /><br />Further, in deep history resides Europe's core, secular, rational, modern and \"natural\" self.<br /><br />Yet, these concepts are often used to depict histories of people (living or extinct) and their livelihoods and habitats, which lie beyond Europe and its frames of deep history. <br /><br />At the same time, there is an entrenchment of deep history, more as an adjective (rather than as a noun) in Asia, South America, Africa and Australia, in their respective geomythologies, sacred geographies, and questions of aboriginalities. <br /><br />There is also an emerging and exciting scholarship around deep history from Asia, Africa, South America and Australia.<br /><br />We need to have a roundtable discussion to take stock of what this is doing to existing ideas of deep history and if there is a need to re-evaluate its changing parameters.<br /><br /> Therefore, the question of whether deep history 'white' is not primarily a racial one, rather it is epistemological. It questions the pre-eminence of European deep naturalism.<br /><br /> Some of the questions for the group could be:<br /><br />•         Is deep history, as we know it, 'White'?<br /><br />•         Is that deep history complicit in the Western and colonial appropriation of global nature, time, myths and capital?  <br /><br />•         What is the power of deep history as a white mythology, in epistemology and in governance?<br /><br />•         Is a Black deep history possible or even desirable?<br /><br />Confirmed participants: Pratik Chakrabarti, Sarah Qidwai, Myrna P. Sheldon",
    "Abstract Topic": "Earth and Environmental Sciences",
    "Abstract Chronology": "Nineteenth century",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "Deep History, geohistory, aboriginality",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 79.0.3945.117 / Windows",
    "IP Address": "90.220.154.140",
    "Unique ID": 572943777,
    "Location": "51.599998474121, -0.033300001174212"
  },
  {
    "Time": "2020-01-21 14:36:23",
    "Name (First)": "Hippolyte",
    "Name (Last)": "Goux",
    "Email": "goux@ucla.edu",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Technopolitics and Economy",
    "Session idea, abstract, or other information relevant for potential collaborators": "Historians of science and technology have carefully attended to the political consequences of technological systems. This junction of social organization and technology-now called technopolitics-has been described as the production of a nearly autonomous system, or as a system that shaping the political. Less satisfactory in these studies has been their treatment of the economic. What is called economy is both a system of power and the basis for the material production and reproduction of society. It is in many ways a feature unique to capitalism. Yet the economic cannot be reduced to just a system of power, or technological structures-although it contains both. It would seem that the relation between justice and infrastructure cannot be understood without a proper consideration of economy.  <br /><br />We seek presentations investigating the interaction or co-extension of technopolitics with economic \"logics,\" on a global or local scale. Work on any geographical area and time period is welcome. <br /><br />This session would be submitted jointly to SHOT and HSS. <br /><br />In case of interest, please provide a one-page abstract (250 words maximum) to Hippolyte Goux at goux@ucla.edu no later than February 15th 2020.  <br /><br />",
    "Abstract Topic": "Technology",
    "Abstract Chronology": "Longue Durée",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "Economy, Capital, Capitalism, Technopolitics",
    "Notes": "Time periods of interest: Nineteenth century,  Twentieth century, Twenty-first century",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 78.0.3904.108 / OS X 10.10 Yosemite",
    "IP Address": "23.243.161.171",
    "Unique ID": 573971977,
    "Location": "34.031101226807, -118.48999786377"
  },
  {
    "Time": "2020-01-24 13:40:09",
    "Name (First)": "Kathleen",
    "Name (Last)": "Sheppard",
    "Email": "kathleen.l.sheppard@gmail.com",
    "I'm interested in...": "Forming a roundtable",
    "Tentative Title": "The Future of Digital Humanities in the History of Science",
    "Session idea, abstract, or other information relevant for potential collaborators": "The Technology and Communication Committee are sponsoring and forming a round-table in order to discuss issues in digital humanities in the history of science. We hope to have an open, but organized, discussion where attendees can share their working projects, their project ideas, or simply their opinions on the digital humanities in history of science, as well as learn more about how DH is working (or not) within the discipline. Further, we want your input on how the TCC can work within HSS and with its members to make projects easier to create, to promote projects, and to help develop plans for supporting DH in the years to come. Please submit ideas for presentations for this round-table! All levels of expertise are welcome.",
    "Abstract Topic": "Tools for Historians of Science",
    "Abstract Chronology": "Twenty-first century",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "Digital Humanities; technology; tools",
    "Notes": "This will be more of a round-table workshop and would sit in multiple categories.",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 79.0.3945.130 / Windows",
    "IP Address": "131.151.252.121",
    "Unique ID": 574894809,
    "Location": "37.926498413086, -91.779098510742"
  },
  {
    "Time": "2020-02-02 20:06:46",
    "Name (First)": "Mark",
    "Name (Last)": "Hineline",
    "Email": "mark.hineline@gmail.com",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Graphic Narratives for History of Science",
    "Session idea, abstract, or other information relevant for potential collaborators": "Much of the representation in the earth sciences is visual: maps, images, charts, and graphs. The range of images is particularly rich. This is true, to a similar or lesser extent, for other sciences. This session will explore ways of working in history of science using many of the same visual objects, but in narrative form - a genre that was introduced as a possibility by Martin J. S. Rudwick in \"The Great Devonian Controversy\" but not fully realized from that initial model.",
    "Abstract Topic": "Tools for Historians of Science",
    "Abstract Chronology": "Cultural and cross-cultural contexts, including colonialism in general",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "visual; graphic; narrative",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Safari 13.0.5 / OS X",
    "IP Address": "184.98.57.201",
    "Unique ID": 577419315,
    "Location": "33.448398590088, -112.07399749756"
  },
  {
    "Time": "2020-02-04 19:36:00",
    "Name (First)": "Marsha",
    "Name (Last)": "Richmond",
    "Email": "marsha.richmond@wayne.edu",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Environment, Industry, and Organisms",
    "Session idea, abstract, or other information relevant for potential collaborators": "By the 1960s, society could no longer ignore problems caused by decades of industrial pollution of the atmosphere and waterways, nor new postwar threats caused by newly introduced industrial chemicals such as pesticides.  After the founding of the US Environmental Protection Agency in 1970 and the passage of the Clean Air and Clean Water Acts, as well as the banning of production of DDT and PCBs, many environmentalists and wildlife biologists were hopeful that reducing pollution and harsh chemicals would improve outcomes for organisms. But the rapid expansion of the chemical industry led to even more daunting environmental problems in the 1980s that affected humans as well as wildlife.  This session seeks to explore intersections of factors connected with the environment, biology, industrial growth, and public health in the decades after the Second World War.",
    "Abstract Topic": "Earth and Environmental Sciences",
    "Abstract Chronology": "Twentieth century, late",
    "Abstract Geography": "North America",
    "Self-Designated Keywords": "environment; pollution; biotechnology; industry;",
    "Notes": "I would be happy to reshape the abstract to fit projects that require a different descriptor..",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 79.0.3945.130 / Windows",
    "IP Address": "99.57.175.109",
    "Unique ID": 578098664,
    "Location": "42.352298736572, -83.027099609375"
  },
  {
    "Time": "2020-02-05 03:16:39",
    "Name (First)": "Jaume",
    "Name (Last)": "Sastre-Juan",
    "Email": "jaume.sastre@uab.cat",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Science Popularization as Cultural Diplomacy: UNESCO (1946-1958)",
    "Session idea, abstract, or other information relevant for potential collaborators": "From its creation after World War II, UNESCO became a political battleground in which different visions of science and the world order fought for hegemony. As it is well known, Julian Huxley (1887-1975) and Joseph Needham (1900-1995) were the first General Director and the first Director of the Natural Sciences Division. Their administration stressed the \"social implications of science\" -through the influence of Bernalist Marxism- and the \"periphery principle\" in international relations. They also included science popularization in its priorities, but UNESCO's popularization program would only start once the Cold War increased in intensity and Huxley and Needham's policies were substituted by the leadership of the physicist Pierre Auger (1899-1993), as new head of the Natural Sciences Division. <br /><br />The goal of this session is to explore the history of international science popularization policies and practices at UNESCO as tools for governance and cultural diplomacy from the Huxley-Needham administration to the end of Auger's leadership in 1958. Who were the main actors behind the global science popularization program at UNESCO? What were their political agendas? What were their specific approaches to science, internationalism, diplomacy and popularization? How were UNESCO's popularization policies actually implemented around the world in different national and local contexts? What was the role of science popularization in the global reconfiguration of international relations? Historiographically, we would like to engage with the literature that has focused on the politics of science popularization, the literature which is reassessing scientific internationalism as a historically and ideologically situated practice and the renovated interest in science and diplomacy. While our main focus is the period 1946-1958, we are flexible in terms of chronology: case-studies exploring the continuities and ruptures with the League of Nations, as well as the 1960s are also welcome",
    "Abstract Topic": "Aspects of Scientific Practice/Organization",
    "Abstract Chronology": "Twentieth century, late",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "UNESCO; science popularization; cultural diplomacy; international relations; internationalism",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Firefox 72.0 / Windows",
    "IP Address": "2.152.194.83",
    "Unique ID": 578171967,
    "Location": "41.388801574707, 2.1589999198914"
  },
  {
    "Time": "2020-02-05 16:58:30",
    "Name (First)": "Noa",
    "Name (Last)": "Nahmias",
    "Email": "noanahmias5@gmail.com",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Scientific Knowledge Between Local and Global",
    "Session idea, abstract, or other information relevant for potential collaborators": "I am seeking collaborators for a panel exploring the production of global and local in the 19th and 20th centuries. <br /><br />Global histories of science encourage us to think beyond the borders of the nation, and turn our attention to circulation, networks, and knowledge in motion. In the context of Imperial expansion and colonialism in the 19th and 20th centuries, these interactions occurred frequently and relied on various actors imagining science as universal while participating in its localization. This panel will examine a variety of ways knowledge moves to consider the tensions and possibilities of the categories \"local\" and \"global.\" To what degree are these binary opposites? What might exist in the space between the local and the global? What kind of tensions did the definition of either category produce? <br /><br />In terms of geography, I work on China in the 20th Century. The panel is open to all geographic foci, but potentially would be most suited to those working on colonial contexts. <br /><br />Potential papers could focus on <br /><br />-\tKnowledge circulation between different regions or countries <br /><br />-\tTranslation as \"localizing\" knowledge<br /><br />-\tPopular science as knowledge transmission<br /><br />-\tScience nationalism and internationalism<br /><br />-       Tensions between the local and national <br /><br />The abstract is a suggestion of broad themes, and will be adapted to better fit the shared goals and interests of potential collaborators. <br /><br />",
    "Abstract Topic": "Thematic Approaches to the Study of Science",
    "Abstract Chronology": "Twentieth century, early",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "circulation, global history, colonialism",
    "Notes": "The abstract is a suggestion of broad themes, and will be adapted to better fit the shared goals and interests of potential collaborators.",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 79.0.3945.130 / Windows",
    "IP Address": "135.23.102.183",
    "Unique ID": 578395292,
    "Location": "43.665500640869, -79.420402526855"
  },
  {
    "Time": "2020-02-06 11:09:58",
    "Name (First)": "Aimee",
    "Name (Last)": "Slaughter",
    "Email": "slaughter.aimee@gmail.com",
    "I'm interested in...": "Forming a roundtable",
    "Tentative Title": "When History of Science and Technology Is Difficult History",
    "Session idea, abstract, or other information relevant for potential collaborators": "How do we talk about the history of technology and science when it's difficult history? Public historians and museum professionals use the term \"difficult history\" to describe histories of injustice or violence, histories that can often be challenging for audiences. Examples in history of science and technology include eugenics, the Manhattan Project, national responses to disasters and environmental hazards, and many more large- and small-scale topics.  In this roundtable we hope to start an open conversation around the intersections between difficult history and the history of science and technology: How do we talk about these histories with the public and with students? What responsibilities do we have as a field when engaging with difficult history in our scholarship?<br /><br />Ten-minute presentations on a variety of topics are welcome in this roundtable, which will be submitted as a joint session of SHOT and HSS.<br /><br />",
    "Abstract Topic": "Tools for Historians of Science",
    "Abstract Chronology": "Cultural and cross-cultural contexts, including colonialism in general",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "difficult history; public history; roundtable",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Firefox 69.0 / OS X",
    "IP Address": "97.123.7.181",
    "Unique ID": 578761463,
    "Location": "35.075698852539, -106.64060211182"
  },
  {
    "Time": "2020-02-06 15:30:49",
    "Name (First)": "Courtney",
    "Name (Last)": "Thompson",
    "Email": "cthompson@history.msstate.edu",
    "I'm interested in...": "Forming a roundtable",
    "Tentative Title": "Teaching Beyond the Canon in the History of Science",
    "Session idea, abstract, or other information relevant for potential collaborators": "Despite the many transformations of the field and its methodologies, collections of primary sources in the history of science often focus on the major works of \"great men\" in the history of science, who tend to be white, male, and from Europe or the United States. Primary sources in the history of science also frequently privilege published scientific texts, which can be difficult for students to understand, and which neglect other kinds of documents and sources, such as letters, diaries, popular publications, images, and artifacts. <br /><br />This roundtable will offer strategies for decolonizing the syllabus and incorporating non-traditional sources, moving history of science pedagogy away from a focus on \"great men\" and white, male, Western perspectives and towards a broader, more inclusive, and more creative approach to sources and case studies. I'm seeking participants who have incorporated non-Western and/or non-traditional case studies, primary sources, and experiences into their approaches to teaching the history of science. <br /><br />Informal ten-minute presentations on primary sources and other ideas for approaching history of science pedagogy from scholars in any area of the history of science are welcome. Additionally, the participants will collaborate to put together a collection of primary sources and other resources beyond the canon that can be shared with attendants to incorporate into their courses. <br /><br />",
    "Abstract Topic": "Tools for Historians of Science",
    "Abstract Chronology": "Cultural and cross-cultural contexts, including colonialism in general",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 79.0.3945.117 / OS X",
    "IP Address": "130.18.104.111",
    "Unique ID": 578858331,
    "Location": "33.453098297119, -88.793197631836"
  },
  {
    "Time": "2020-02-10 08:48:57",
    "Name (First)": "Tabea",
    "Name (Last)": "Cornel",
    "Email": "tcornel@ncf.edu",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Another Vast Machine: Data, Models, and Simulations in the Human Sciences",
    "Session idea, abstract, or other information relevant for potential collaborators": "I welcome any suggestions that broadly fit this topic. It would be particularly exciting if the panel covered a wide range of geographic and disciplinary foci.<br /><br />Ten years ago, Paul Edwards argued that the \"vast machine\" of meteorology had neared completion. Global systems of weather observation, data manipulation, and data interpretation have not tamed the climate, but they have established (almost) undeniable facts about it, including the existence of global warming. More recently, data, models, and simulations have become essential to the human sciences. Recidivism algorithms, genetic diagnostics, and multivariate pattern analysis are only three examples of the numerous technologies on which scientists rely to establish facts about humanity and predict the future of individual humans. How did these technologies originate? What consequences are there, if any, of applying technologies to humans that had originally been developed for non-human systems? How stable have such technologies and related concepts been across time, space, and cultures? To what extent have these technologies reinforced or eroded power dynamics within and between scientific communities? In what ways have these technologies helped or hindered establishing (almost) undeniable facts about humanity?",
    "Abstract Topic": "Aspects of Scientific Practice/Organization",
    "Abstract Chronology": "Longue Durée",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "big data; human sciences; models",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Firefox 72.0 / Windows",
    "IP Address": "131.247.152.152",
    "Unique ID": 579802634,
    "Location": "28.063100814819, -82.412803649902"
  },
  {
    "Time": "2020-02-10 11:36:20",
    "Name (First)": "Marcos Aurélio",
    "Name (Last)": "Silva",
    "Email": "marcosaureliojf@hotmail.com",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "The Chemistry of Indigenuos Peoples",
    "Session idea, abstract, or other information relevant for potential collaborators": "The chemistry of indigenuos peoples techniques pharmaceutical science important scientist research legacy of indigenuos peoples",
    "Abstract Topic": "Chemistry",
    "Abstract Chronology": "Prehistory and early human societies",
    "Abstract Geography": "Latin America",
    "Self-Designated Keywords": "",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome Mobile 80.0.3987.87 / Android",
    "IP Address": "177.104.86.193",
    "Unique ID": 579865218,
    "Location": "-21.762199401855, -43.348098754883"
  },
  {
    "Time": "2020-02-11 04:45:21",
    "Name (First)": "Kristin",
    "Name (Last)": "Halverson",
    "Email": "kristin.halverson@sh.se",
    "I'm interested in...": "Joining an organized session",
    "Tentative Title": "Tools of the Trade: Medical Devices and Meaning in Sweden and Denmark, 1850 - 1900",
    "Session idea, abstract, or other information relevant for potential collaborators": "Hi! I am a PhD student studying the relationships between medical devices, technological change and practice in Sweden and Denmark in the nineteenth century. I would be interested in joining a session that deals with themes involving medical technologies, nineteenth century medicine, circulation of scientific knowledge and sessions involving innovation processes. I conceptualise \"device\" rather broadly, so technologies involving everything from surgical instruments, operating tables and orthopaedic devices to early roentgen apparatuses could be included, if the session prefers focus on a specific device. I have an abstract ready for potential collaborations. I hope to hear from you!",
    "Abstract Topic": "Medicine and Health",
    "Abstract Chronology": "Nineteenth century",
    "Abstract Geography": "Europe",
    "Self-Designated Keywords": "history of medicine; medical technology; medical device; nineteenth century medicine; innovation",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 64.0.3282.119 / OS X",
    "IP Address": "193.10.137.41",
    "Unique ID": 580415728,
    "Location": "59.324699401855, 18.055999755859"
  },
  {
    "Time": "2020-02-12 10:51:11",
    "Name (First)": "Matthew",
    "Name (Last)": "Holmes",
    "Email": "mrh70@cam.ac.uk",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "The Septic Fringe: Developing a History of Marginalized Species",
    "Session idea, abstract, or other information relevant for potential collaborators": "The term \"septic fringe\" is used to refer to marginal zones for waste and refuse, which have existed on the edge of human settlements since prehistory. We generally associate the animal and microbial inhabitants of the septic fringe, including bacteria, fungi, insects, birds and rodents, with fear or disgust across human history. Yet new animal and environmental histories have given us fresh insights into human interaction with \"pests\" and \"vermin,\" including how our relationship with them is reflective of wider social and cultural contexts. Histories of biotechnology and biological control have also described how former inhabitants of the septic fringe were rehabilitated into a series of scientific and industrial enterprises. By the early years of the twentieth century, moulds and fungi were instrumental for fermentation based industries, while insects and birds were harnessed by the new science of economic biology to protect agriculture. New industrial farms and microbiological institutes investigated brewing, sterilisation and insect control, with the septic fringe becoming a site of innovation, inspiration and industry. <br /><br />This panel seeks contributions from historians of marginalized species across any time period. Potential papers may include: <br /><br />- Attitudes towards pest species<br /><br />- Control of pests, vermin and microbes<br /><br />- Economic biology<br /><br />- Microbes, fungi or insects in medicine or biotechnology<br /><br />The overall aims of the panel are to see whether the septic fringe can be adopted as a useful heuristic by historians of science, and if we can spot wider trends in histories of marginalized species and organisms. Please feel free to email me to discuss any potential contributions.<br /><br />",
    "Abstract Topic": "Biology",
    "Abstract Chronology": "Longue Durée",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "biological control; biotechnology; pests; septic fringe",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 79.0.3945.130 / Windows",
    "IP Address": "51.148.137.203",
    "Unique ID": 581161920,
    "Location": "51.5, -0.11670000106096"
  },
  {
    "Time": "2020-02-17 16:41:40",
    "Name (First)": "Brad",
    "Name (Last)": "Bolman",
    "Email": "bolman@g.harvard.edu",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Animals in/as Technologies",
    "Session idea, abstract, or other information relevant for potential collaborators": "Rachel Ankeny and I are hoping to bring together historians of science and technology for a cross-organization panel on the use of nonhuman organisms (broadly considered) as technologies. We're thinking of assistance animals, working animals, scientific organisms, and more. Studies can be of any period and we're particularly keen for global or multinational contributions. Our hope is to create dialogue between HSS and SHOT members about the multiple meanings of these practices with an eye toward discussions of organisms as platforms, frameworks, capital, and beyond.",
    "Abstract Topic": "Biology",
    "Abstract Chronology": "Cultural and cross-cultural contexts, including colonialism in general",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "animal studies",
    "Notes": "Please reach out with any questions!",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Firefox 73.0 / OS X",
    "IP Address": "66.31.19.46",
    "Unique ID": 582571681,
    "Location": "42.382801055908, -71.095497131348"
  },
  {
    "Time": "2020-02-17 16:54:56",
    "Name (First)": "Alison",
    "Name (Last)": "McManus",
    "Email": "alison.mcmanus@princeton.edu",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Extraction, Reaction, Production: Telling the Histories of Chemistry through Labor",
    "Session idea, abstract, or other information relevant for potential collaborators": "Chemistry and economics share a vocabulary of transformation and separation. Yield, production, extraction, and reaction are just a few terms that apply to both the study of matter and the production of value, broadly construed. Though not analytically significant on its own, this terminological overlap has the potential to guide historical research in at least two ways. First, it instructs us to take labor as a serious element of the (al)chemical sciences. Indeed, historians have shown how labor-atory practice, material properties, and economic constraints conditioned the development and reception of alchemy and chemistry. Second, we may also turn the aforementioned method on its head, taking the history of chemistry as a key consideration in labor history. Thinking with labor reminds us that pressing present-day questions about chemical science and technology in the Anthropocene, such as the expansion of the chemical industry, the globalization of markets, and the ubiquity of toxic exposures, also exemplify long-term historical patterns and processes. Accordingly, this panel provides a robust look at the relationships between labor, in all its forms, and chemistry, in all its guises and applications. In so doing, it gestures toward the following questions: What can the history of chemistry offer labor history, and what can labor history offer the history of chemistry?",
    "Abstract Topic": "Chemistry",
    "Abstract Chronology": "Longue Durée",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "chemistry; environmental history; industry",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 79.0.3945.130 / OS X 10.10 Yosemite",
    "IP Address": "140.180.240.189",
    "Unique ID": 582575072,
    "Location": "40.375598907471, -74.659698486328"
  },
  {
    "Time": "2020-02-18 04:39:29",
    "Name (First)": "Neeraja",
    "Name (Last)": "Sankaran",
    "Email": "dr.sankaran06@gmail.com",
    "I'm interested in...": "Joining an organized session",
    "Tentative Title": "The  Hidden Histories of DNA",
    "Session idea, abstract, or other information relevant for potential collaborators": "DNA has had such a very visible public life--beginning from the moment that Watson and Crick announced their discovery of its double helix structure at a pub in Cambridge, that it is easy to overlook many important landmarks in the history of this molecule. The very discovery of the material, way back in 1871 is one example of a hidden or nearly hidden, history, as is the story of the very first X-ray photograph of the molecule--no, not Rosalind Franklin, but yes, it was a woman--and the  immediate aftermath of the 1944 demonstration that DNA was the material of genes (though admittedly it was not reported in those terms). These are just threeexamples  in what I am sure is a long list of secret, hidden or forgotten episodes in the history of DNA. So... if you have a DNA story that you  would  like to share, this is the place to do it. I already submitted this idea under a slightly different title (secret life instead of hidden histories) for an organized session, but felt that it was equally suitable for the round-table format. In fact, its less intimidating for some since we have less time per person. So please get in touch, if you have any ideas. Very short notice I know  (barely 10 days) but please get in touch... thus  far I am a party of one, and if I don't hear anything in  a week, I'll go ahead and submit my idea as a stand alone.",
    "Abstract Topic": "Biology",
    "Abstract Chronology": "Twentieth century, early",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "DNA; Hidden histories;",
    "Notes": "Equally viable in either this (round-table) or the organized format. Get in touch and we can discuss preferred formats",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Firefox 73.0 / OS X",
    "IP Address": "81.104.156.142",
    "Unique ID": 582684280,
    "Location": "51.979400634766, -0.22660000622272"
  },
  {
    "Time": "2020-02-18 10:05:13",
    "Name (First)": "Amy",
    "Name (Last)": "Fisher",
    "Email": "afisher@pugetsound.edu",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Ephemeral Phenomena: Science and Technology in Experimental and Observational Research",
    "Session idea, abstract, or other information relevant for potential collaborators": "We are looking for one collaborator and possibly a commentator or chair for the following session, which has a strong theme that cuts across different cultural contexts and time periods. If you are interested in joining us or would like further information, please send an email to afisher (at) pugetsound.edu. Thank you!<br /><br />Draft Abstract: This session explores the intricate relationship between science and technology in experimental and observational research. As Jennifer Alexander (2012, p. 519) notes, \"many historians of technology have decisively rejected 'applied science' as a useful term, already seeing in it precisely the subordination to science that [Paul] Forman describes,\" e.g., in his 2007 article 'The Primacy of Science in Modernity, of Technology in Postmodernity, and of Ideology in the History of Technology,' \"and thus a denial of the intellectual autonomy of their subject.\" In contrast, this session investigates themes from the history of technology and the history of science on equal footing. It shows the complex interplay between the development of new instruments and experimental techniques and scientific discovery prior to 1980. By combining the history of science and technology, it illuminates not only the ways in which technological development contributed to the study of ephemeral phenomena, but also how it broadened the accessibility of some areas of scientific research, especially in environmental and electrical science.<br /><br /> <br /><br />Alexander, Jennifer Karns. \"Thinking Again about Science in Technology.\" Isis 103, no. 3 (2012): 518-26.<br /><br /> <br /><br />Forman, Paul. \"The Primacy of Science in Modernity, of Technology in Postmodernity, and of Ideology in the History of Technology.\" History and Technology 23, no. 1-2 (2007): 1-152.<br /><br />",
    "Abstract Topic": "Technology",
    "Abstract Chronology": "Cultural and cross-cultural contexts, including colonialism in general",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Firefox 72.0 / OS X",
    "IP Address": "24.19.80.151",
    "Unique ID": 582756102,
    "Location": "47.167999267578, -122.50270080566"
  },
  {
    "Time": "2020-02-20 00:13:27",
    "Name (First)": "Somaditya",
    "Name (Last)": "Banerjee",
    "Email": "banerjees@apsu.edu",
    "I'm interested in...": "Forming a roundtable",
    "Tentative Title": "Should Historians of Science Know the Contents of Science?",
    "Session idea, abstract, or other information relevant for potential collaborators": "We are looking for three collaborators for the following session, which has an important theme that cuts across different cultural contexts and methodological approaches. If you are interested in joining us or would like further information, please send an email to banerjees@apsu.edu. <br /><br />Draft Abstract: This round table asks a classic question in history of science: Should historians of science know science and master its contents? The history of science has long been plagued by debates between \"internalists\" and \"externalists.\" Broadly speaking, internalists concerned themselves with the technical and conceptual development of science while externalists were motivated by culture, politics, and the sociology of science. Thomas Kuhn writing in the International Encyclopaedia of the Social Sciences in 1968 remarked \"Until very recently most of those who wrote the history of science were practicing scientists, sometimes eminent ones.\" More recently in 1998, Alan Shapiro writing in the The Chronicle of Higher Education argued that \"By neglecting internal history and disregarding content, scholars are turning their backs on a large audience of scientists and students.\" One important caveat for the cultural history of science was that the cultural values that were prevalent spatially and temporally exerted influences on scientific research, including the content of science, as revealed in the history of modern physics. Hence this panel will problematize the \"internalist\" and \"externalist\" approaches and will engage in a discussion about whether it is productive for historians to understand the sciences, thereby building 'bridges' between history and science.<br /><br />References:<br /><br />Kuhn, T. S.: 1968, 'The History of Science', in International Encyclopedia of the Social Sciences, Macmillan Co. & Free Press, New York, vol. 14, pp. 74-83.<br /><br />Shapiro, Alan E. 1998, \"Historians of Science Must Again Master Scientific Substance,\" The Chronicle of Higher Education XLIV, no.21, sec B",
    "Abstract Topic": "Theoretical Approaches to the Study of Science",
    "Abstract Chronology": "Cultural and cross-cultural contexts, including colonialism in general",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "history; science; culture",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Firefox 72.0 / OS X",
    "IP Address": "162.247.54.91",
    "Unique ID": 583335706,
    "Location": "36.559700012207, -87.409698486328"
  },
  {
    "Time": "2020-02-20 23:31:02",
    "Name (First)": "Emily",
    "Name (Last)": "Hutcheson",
    "Email": "hutcheson2@wisc.edu",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Genres of Scientific Knowledge",
    "Session idea, abstract, or other information relevant for potential collaborators": "I am seeking collaborators for a panel exploring how textual genres shape scientific knowledge production and circulation. <br /><br />Scientific texts are not just vehicles for words, but are cultural artifacts made through efforts specific to their time and place. Genres of scientific knowledge involve authorial choices that shed light on the modes of their production and have the potential to facilitate the spread of knowledge between cultures. This session will explore how generic conventions affect how knowledge is moved between cultures via written inscriptions of objects. How does genre affect the practice of science and its reception? What does genre tell us about the practitioners of science themselves, their intentions and limitations? My case study centers on a Dutch botanist who published the findings from her research travels in the Dutch East Indies in a variety of genres: a travel narrative, scientific monographs and scientific articles. I use genre analysis to understand how scientific knowledge gathered in a local context came to circulate globally and to investigate what information was erased in the process. The types of publications and expectations for this scientist, a woman, also give insight into how both the practice of science and scientific publication were structured by gendered norms.  <br /><br />Possible themes could be: <br /><br />--Scientific knowledge production and dissemination <br /><br />--Genre  and scientific networks <br /><br />--Global/local knowledge production<br /><br />--Genre and scientific disciplines <br /><br />--Genre and gender <br /><br />--Popularization of science<br /><br /><br /><br /> <br /><br /><br /><br />",
    "Abstract Topic": "Aspects of Scientific Practice/Organization",
    "Abstract Chronology": "Cultural and cross-cultural contexts, including colonialism in general",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "scientific publication; circulation of knowledge; genre",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 80.0.3987.116 / OS X",
    "IP Address": "99.11.249.86",
    "Unique ID": 583635524,
    "Location": "30.16780090332, -97.82250213623"
  },
  {
    "Time": "2020-02-24 13:43:25",
    "Name (First)": "Peter",
    "Name (Last)": "Kleeman",
    "Email": "peter@spaceagemuseum.com",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Public Participation In/Public History of Space Exploration",
    "Session idea, abstract, or other information relevant for potential collaborators": "We are seeking one or two collaborators, and a commentator or chair for the following session. If you are interested in joining us or would like further information, please email peter@spaceagemuseum.com. <br /><br /><br /><br />DRAFT ABSTRACT: <br /><br />Responding to the myriad commemorations of the 50th anniversary of the Apollo moon landing in 2019, this panel will offer historical perspectives on public participation in and production of a celebratory culture around space exploration and space science. It will address how and where Americans made (and make) personal meaning of the nation's activities in outer space, and highlight stories of individuals traditionally excluded from narratives of space history. Finally, it will consider the implications of the legacy of public participation in space exploration for public history today.    <br /><br />We welcome papers related to the following questions, as well as related themes:<br /><br />Who participates in the culture of space exploration and space science?<br /><br />What are the roles of popular media, science fiction, museums, and other places in the production of space culture? <br /><br />What does it mean to be part of a spacefaring species?<br /><br />How can historians identify and tell stories of previously-unrecognized individuals? <br /><br />How can these stories serve public history audiences?",
    "Abstract Topic": "Thematic Approaches to the Study of Science",
    "Abstract Chronology": "Twentieth century, late",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "Space History; Public History; Popular Culture; Space Tourism; Science Fiction",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 80.0.3987.87 / OS X",
    "IP Address": "97.80.121.119",
    "Unique ID": 584484848,
    "Location": "42.186100006104, -72.525497436523"
  },
  {
    "Time": "2020-02-25 17:11:47",
    "Name (First)": "Tina",
    "Name (Last)": "Gianquitto",
    "Email": "tinagian@mines.edu",
    "I'm interested in...": "Forming a roundtable",
    "Tentative Title": "Narrative as Practice in the Life Sciences",
    "Session idea, abstract, or other information relevant for potential collaborators": "Narratives and figurative language play a constitutive role in the life sciences, helping to structure both theory and practice. In the life sciences, for instance, an individual organism may be turned into a species-representative collection: A plant is pressed for inclusion in an herbarium; the pressed plant becomes a microcentrifuge tube of DNA; the DNA then attains a digital identity as a sequence of nucleotides; then the sequence may be both disseminated and reconstituted, producing new accounts of whole organisms and their interactions. Participants in the roundtable explore this weaving together of data and narrative by bringing case studies from the 18th century to the present day into conversation. In particular, we ask how ecological data and evolutionary histories are generated both by different types of evidence and by the stories that scientists tell about that evidence. What are the narratives and figurative forms of language that allow life scientists to link, transform, and equate these radically different forms of knowledge about organisms? Our roundtable brings together participants from a range of disciplines (history of science, literature, [biology, and ecology]); collectively, we consider how analysis of narrative practices in the life sciences may open lines of communication between humanities scholars and scientists.",
    "Abstract Topic": "Thematic Approaches to the Study of Science",
    "Abstract Chronology": "Longue Durée",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "narrative; life sciences; evidence and figurative language",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Safari 12.1.1 / OS X",
    "IP Address": "138.67.206.6",
    "Unique ID": 584940512,
    "Location": "39.714599609375, -105.2433013916"
  },
  {
    "Time": "2020-02-27 18:47:21",
    "Name (First)": "Youngsuk",
    "Name (Last)": "Park",
    "Email": "ysukpk@gmail.com",
    "I'm interested in...": "Joining an organized session",
    "Tentative Title": "Instruments and Forms of Daily life of Modernity of Joseon Korea and America in the 18-19th Centuries",
    "Session idea, abstract, or other information relevant for potential collaborators": "This is a comparison of culture theory of domestic economy of Korea and America during the 18-19th centuries. The basis is two classics, Salimgyeongje (山林經濟, Domestic Economy of Country Life, 1718) compiled by Hong Manseon of the late Joseon dynasty (1392-1910) and the Encyclopedia of Domestic Economy (early 19th c.) by Thomas Webster of the Great Britain. The two encyclopedic compilations provide respective domestic space of each culture for practical application of knowledge during the Enlightenment era. On one hand it is the eco-naturalism that originated from the traditional syncretism of Buddhism, Daoism and Confucianism of the east. The other is the reason-oriented mechanism and anthropocentrism of the progressively modernizing west. The existence of two worldviews prior to the encroachment of west-oriented modernization influence provides an insight into a competing view of Nature or natural science/philosophy. Everyday tools and forms, such as heating system, pressure-steam cooker or fomentation process prominently express these ideas. In the effort to improve the usefulness of daily life, the two domestic economies reveal contrasting meaning of life, human theory, and aestheticism at the dawn of their modernity.",
    "Abstract Topic": "Thematic Approaches to the Study of Science",
    "Abstract Chronology": "Early Modern",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "Encyclopedia of Domestic Economy; Daily Life; Instruments; Joseon Korea; America; 18-19th Centuries; Modernity; Eco-Naturalism; Mechanism; Anthropocentrism",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Mozilla rv:11.0 / Windows",
    "IP Address": "220.81.201.94",
    "Unique ID": 585736954,
    "Location": "37.453601837158, 126.73169708252"
  }
]
