[
  {
    "Time": "2020-01-12 12:16:19",
    "Name (First)": "Gianamar",
    "Name (Last)": "Giovannetti-Singh",
    "Email": "gg410@cam.ac.uk",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Credibility in Circulation: What Role Did Non-European Knowledges Have in Shaping the Methods of Modern Disciplines?",
    "Session idea, abstract, or other information relevant for potential collaborators": "In 2006, Kapil Raj published his ground-breaking Relocating Modern Science, in which he argued that historians of science have much to learn from relocating their studies of the construction of knowledge from \"local\" sites to spaces of circulation. This shift, Raj argues, reveals the indispensable role played by non-European actors and knowledges in the co-construction of methods and practices that have gone on to shape modern \"Western\" science. Since then, historians-particularly those striving to understand the non-Western character of what has elsewhere been characterised as \"European modernity\"-have employed Raj's methods to great effect. One key issue that deserves further examination, using episodes from across historical and geographical regions, is that of the credibility of non-European methods in shaping emergent disciplines in the Enlightenment. For example, in his recent work on the \"first global turn\", Alexander Statman has suggested that Europeans' encounters with Chinese history in the seventeenth and eighteenth centuries radically reshaped conceptions of what history could look like as an academic discipline. How does a shift from local to circulating spaces change the way historians of science can analyse the construction of credibility? This panel seeks to explore the processes involved in constructing credibility in spaces of circulation and examine whether this reveals previously under-appreciated non-European influences upon ostensibly \"European\" methods in emergent disciplines during the Enlightenment.",
    "Abstract Topic": "Tools for Historians of Science",
    "Abstract Chronology": "Cultural and cross-cultural contexts, including colonialism in general",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "Enlightenment; disciplinarity; cross-cultural encounters; modernity; circulation",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Safari 13.0.2 / OS X",
    "IP Address": "131.111.5.151",
    "Unique ID": 571502471,
    "Location": "52.200000762939, 0.11670000106096"
  },
  {
    "Time": "2020-01-17 02:01:32",
    "Name (First)": "Pratik",
    "Name (Last)": "Chakrabarti",
    "Email": "pratik.chakrabarti@manchester.ac.uk",
    "I'm interested in...": "Forming a roundtable",
    "Tentative Title": "Is Deep History White?",
    "Session idea, abstract, or other information relevant for potential collaborators": "The need for the roundtable discussion emerges from the realization that the history of deep time is predominantly derived from the works of European savants from the eighteenth century. These propositions refer to European intellectual traditions, antiquarianism and religious debates. Similarly, the histories of deep time and geohistory too are invested in European intellectual traditions, museums, institutions, print cultures and epistemologies even when these have extended these beyond Europe. Further, in deep history resides Europe's core, secular, rational, modern and \"natural\" self. Yet, these concepts are often used to depict histories of people (living or extinct) and their livelihoods and habitats, which lie beyond Europe and its frames of deep history. At the same time, there is an entrenchment of deep history, more as an adjective (rather than as a noun) in Asia, South America, Africa and Australia, in their respective geomythologies, sacred geographies, and questions of aboriginalities. There is also an emerging and exciting scholarship around deep history from Asia, Africa, South America and Australia.We need to have a roundtable discussion to take stock of what this is doing to existing ideas of deep history and if there is a need to re-evaluate its changing parameters. Therefore, the question of whether deep history 'white' is not primarily a racial one, rather it is epistemological. It questions the pre-eminence of European deep naturalism. Some of the questions for the group could be:•     Is deep history, as we know it, 'White'?•     Is that deep history complicit in the Western and colonial appropriation of global nature, time, myths and capital? •     What is the power of deep history as a white mythology, in epistemology and in governance?•     Is a Black deep history possible or even desirable?Confirmed participants: Pratik Chakrabarti, Sarah Qidwai, Myrna P. Sheldon",
    "Abstract Topic": "Earth and Environmental Sciences",
    "Abstract Chronology": "Nineteenth century",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "Deep History, geohistory, aboriginality",
    "Notes": "",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 79.0.3945.117 / Windows",
    "IP Address": "90.220.154.140",
    "Unique ID": 572943777,
    "Location": "51.599998474121, -0.033300001174212"
  },
  {
    "Time": "2020-01-21 14:36:23",
    "Name (First)": "Hippolyte",
    "Name (Last)": "Goux",
    "Email": "goux@ucla.edu",
    "I'm interested in...": "Forming an organized session",
    "Tentative Title": "Technopolitics and Economy",
    "Session idea, abstract, or other information relevant for potential collaborators": "Historians of science and technology have carefully attended to the political consequences of technological systems. This junction of social organization and technology-now called technopolitics-has been described as the production of a nearly autonomous system, or as a system that shaping the political. Less satisfactory in these studies has been their treatment of the economic. What is called economy is both a system of power and the basis for the material production and reproduction of society. It is in many ways a feature unique to capitalism. Yet the economic cannot be reduced to just a system of power, or technological structures-although it contains both. It would seem that the relation between justice and infrastructure cannot be understood without a proper consideration of economy.   We seek presentations investigating the interaction or co-extension of technopolitics with economic \"logics,\" on a global or local scale. Work on any geographical area and time period is welcome.  This session would be submitted jointly to SHOT and HSS.  In case of interest, please provide a one-page abstract (250 words maximum) to Hippolyte Goux at goux@ucla.edu no later than February 15th 2020.",
    "Abstract Topic": "Technology",
    "Abstract Chronology": "Longue Durée",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "Economy, Capital, Capitalism, Technopolitics",
    "Notes": "Time periods of interest: Nineteenth century,  Twentieth century, Twenty-first century",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 78.0.3904.108 / OS X 10.10 Yosemite",
    "IP Address": "23.243.161.171",
    "Unique ID": 573971977,
    "Location": "34.031101226807, -118.48999786377"
  },
  {
    "Time": "2020-01-24 13:40:09",
    "Name (First)": "Kathleen",
    "Name (Last)": "Sheppard",
    "Email": "kathleen.l.sheppard@gmail.com",
    "I'm interested in...": "Forming a roundtable",
    "Tentative Title": "The Future of Digital Humanities in the History of Science",
    "Session idea, abstract, or other information relevant for potential collaborators": "The Technology and Communication Committee are sponsoring and forming a round-table in order to discuss issues in digital humanities in the history of science. We hope to have an open, but organized, discussion where attendees can share their working projects, their project ideas, or simply their opinions on the digital humanities in history of science, as well as learn more about how DH is working (or not) within the discipline. Further, we want your input on how the TCC can work within HSS and with its members to make projects easier to create, to promote projects, and to help develop plans for supporting DH in the years to come. Please submit ideas for presentations for this round-table! All levels of expertise are welcome.",
    "Abstract Topic": "Tools for Historians of Science",
    "Abstract Chronology": "Twenty-first century",
    "Abstract Geography": "Global or Multilocational",
    "Self-Designated Keywords": "Digital Humanities; technology; tools",
    "Notes": "This will be more of a round-table workshop and would sit in multiple categories.",
    "I consent for the History of Science Society to publicize the information contained in this form on my behalf": "Yes",
    "Browser": "Chrome 79.0.3945.130 / Windows",
    "IP Address": "131.151.252.121",
    "Unique ID": 574894809,
    "Location": "37.926498413086, -91.779098510742"
  }
]
